<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<title>EPIC</title>
<link href="static/css/base.css" rel="stylesheet"  media="all"/>
<link href="static/css/fqa.css" rel="stylesheet" media="all" />
</head>

<body>
 {{template "header"}}
 <div class="content">
  <div class="dqwz">当前位置: <a href="faq">FAQ</a> > 企业信息化可持续发展之道</div>
  <h1>企业信息化可持续发展之道</h1>
   <p> 随着网络技术的发展，信息系统也迎来了很多挑战。高并发、高性能、高可用、大数据以及用户越来越高的期望，成为了大部分IT公司的困扰。互联网企业面临更大的冲击，因此纷纷加入云计算阵营。这些先进的技术目前逐步向企业转移。云计算的三层架构，PaaS属于一个承上启下层次。加上PaaS本身的一些价值，使它成为了私有云中的最佳层次。<br /><br />
   云计算是继1980年代大型计算机到客户端-服务器的大转变之后的又一种巨变。发生巨变当然是市场的需要。近年来，互联网规模不断扩大，网络信息化趋势越来越明显。传统的服务器-客户端面临着无法逾越的困难。主要体现在：<br/>
1、	尽管随着制造工艺的提升，硬件成本得到了有效控制。但是怎样的投入才是性价比<br />
最高的方案？无限制的硬件投入肯定不是一个可持续发展的路线。
2、	软件更新已经难以更上硬件更新的步伐。每一次的软件变革总是带来着翻天覆地的变化。开发成本只是一个方面的问题。随之而来还有数据迁移、重新集成等等这些令任何企业都头疼的问题。<br />
3、	庞大的硬件带来的是巨大的消耗。维护团队人员不断增加。而且维护团队不得不随时与网络运营商、硬件供应商保持沟通。<br/>
4、	每当发生用户爆炸性增长或是用户的大规模集中访问。互联网企业都面临着挑战。运维人员甚至开发人员都必须做好通宵达旦的准备。</p>

<p>因为上述的问题，很多企业开始纠结“软件工程没有银弹”的这个观点。当然也有很多企业开始寻找一个方向。尽力了漫长的一个探索过程。2006年3月，亚马逊（Amazon）推出弹性计算云（Elastic Compute Cloud;EC2）服务。亚马逊弹性计算云（EC2，Elastic Compute Cloud）是一个让使用者可以租用云端电脑运行所需应用的系统。EC2拥有简单的Web服务界面让使用者能够迅速调整，无论是增加还是缩减，适应您计算需求的变化。亚马逊EC2让使用者只需为实际使用的计算进行支付。亚马逊EC2上提供开发工具来构建隔离故障应用程序并与日常故障隔离开。这些看似“高级”的功能，其实都是市场驱使的产物。随之而来的是互联网巨头Google，国内比较著名的互联网企业如百度、阿里巴巴，淘宝、搜狐等。架构的演进让他们的技术更上一层楼，也对信息化的多了许多前瞻性。同时，架构的演进（构建业务资源池，让业务处在最合适的资源层次）、让信息化工作参与者（开发人员，实施人员、运维人员、架构人员）更专注自己的领域，就使得大规模信息系统有了更好的“生态”。这个“生态”使得企业能够将更多精力投入到业务积累中，也有了更多精力来分析并找到一条更具有“性价比”更适合企业的发展路线。这个“生态”也致力于改善软件的模式和价值。向着有序，可控，可持续的方向在发展。
   </p>

 </div>
 
{{template "foot"}}
</body>
</html>
